Web Services/1. Webservice Testing/Transactions/findTransactions/Test Case 7/WS_Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tran="http://www.hmco.com/EAI/OTS/Transaction">
   <soapenv:Header/>
   <soapenv:Body>
      <tran:transactionSearchCriteria>
         
         <tran:limitOfResults>10</tran:limitOfResults>
         <!--Optional:-->
         <tran:invoiceNo>945512334</tran:invoiceNo>
         <tran:zipCode>30117</tran:zipCode>
         <tran:partnerFunctionList>
            <!--1 or more repetitions:-->
           <tran:partnerFunction>PARTNER_FUNCTION_SHIPTO</tran:partnerFunction>
	<tran:partnerFunction>PARTNER_FUNCTION_BILLTO</tran:partnerFunction>
<tran:partnerFunction>PARTNER_FUNCTION_SOLDTO</tran:partnerFunction>
         
         </tran:partnerFunctionList>
      </tran:transactionSearchCriteria>
   </soapenv:Body>
</soapenv:Envelope>